import Geolocation from "../Geolocation.js";

describe('parseCoordinates', () => {
  let geolocation = new Geolocation(document.createElement('div'));

  test.each([
    ['-90.00000, -180.00000', { latitude: "-90.00000", longitude: "-180.00000" }],
    ['90.00000, 180.00000', { latitude: "90.00000", longitude: "180.00000" }],
    ['10.12345,0.12345', { latitude: "10.12345", longitude: "0.12345" }],
    ['[10.12345, 0.12345]', { latitude: "10.12345", longitude: "0.12345" }],
  ])('правильные входные данные', (inputData, expectedResult) => {
    expect(geolocation.parseCoordinates(inputData)).toEqual(expectedResult);
  });

  test.each([
    ['-90.00001, -180.00000', 'Значение широты должно быть в диапазоне от -90 до 90'],
    ['90.00001, -180.00000', 'Значение широты должно быть в диапазоне от -90 до 90'],
    ['90.00000, 180.00001', 'Значение долготы должно быть в диапазоне от -180 до 180'],
    ['90.00000, -180.00001', 'Значение долготы должно быть в диапазоне от -180 до 180'],
    ['10.12345.0.12345', 'Неверный формат координат. Ожидается: "широта, долгота"'],
    ['10.12345 0.12345', 'Неверный формат координат. Ожидается: "широта, долгота"'],
    ['10.y2345, 0.12345', 'Неверный формат широты. Пример: 51.50851'],
    ['10.12345, 0.t2345', 'Неверный формат долготы. Пример: -0.12572'],
    ['', 'Неверный формат координат. Ожидается: "широта, долгота"'],
  ])('ошибочные входные данные', (inputData, errorMessage) => {
    expect(() => geolocation.parseCoordinates(inputData)).toThrow(errorMessage);
  });
});